snlkuharlocal/src/DataProcessors/ЗаменаМарокПоЗаказамFBS/ЗаменаМарокПоЗаказамFBS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаменаМарокПоЗаказамFBS</name>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ВидыОперацийМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийМаркировки</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>БронированиеАгрегационныхКодов</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки</name>
    <comment>Трансформация упаковки (Добавление, Изъятие)</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК</name>
    <comment>Трансформация АТК (Добавление, Изъятие)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийИСМП/ВидыОперацийИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийИСМП</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот_Импорт</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот_МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_БезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ВозвратФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ДистанционнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Прочее</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ИспользованиеДляСобственныхНужд</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Конфискация</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоГосударственномуКонтракту</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоОбразцам</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_РозничнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Уничтожение</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Утилизация</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Утрата</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ДистанционнаяПродажа</name>
    <comment>Возврат при дистанционном способе продажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ИспользованиеДляПроизводственныхЦелей</name>
    <comment>Возврат товара, выведенного изоборота  для  производственных целей</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ИспользованиеДляСобственныхНужд</name>
    <comment>Возврат товара, выведенного из оборота для собственных нужд</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи</name>
    <comment>Возврат в оборот возврат приобретение не для перепродажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ПродажаЧерезВендинг</name>
    <comment>Возврат товара, выведенного из оборота для продажи  через  вендинговый аппарат</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_РозничнаяРеализация</name>
    <comment>Возврат при розничной реализации</comment>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
    <comment>Отгрузка в ЕАЭС</comment>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Испорчен</name>
    <comment>Списание не нанесееных КМ. Испорчен.</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Уничтожен</name>
    <comment>Списание не нанесееных КМ. Уничтожен.</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Утерян</name>
    <comment>Списание не нанесееных КМ. Утерян.</comment>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратБезКМ</name>
    <comment>RETAIL_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратБезКМ_ДистПродажи</name>
    <comment>REMOTE_SALE_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратОтКонечногоПокупателя</name>
    <comment>LEGAL_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратРанееЭкспортированногоЕАЭС</name>
    <comment>EEC_EXPORT_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ИспорченоЛибоУтеряно</name>
    <comment>KM_SPOILED</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки_Изъятие</name>
    <comment>REMOVING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки_Добавление</name>
    <comment>ADDING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК_Добавление</name>
    <comment>ADDING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК_Изъятие</name>
    <comment>REMOVING</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыУпаковок/ТипыУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУпаковок</name>
  <enumValues>
    <name>МаркированныйТовар</name>
  </enumValues>
  <enumValues>
    <name>МонотоварнаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>МультитоварнаяУпаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЛистСборкиКомплектовЧЗ/ЛистСборкиКомплектовЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистСборкиКомплектовЧЗ</name>
  <comment>Лист сборки комплектов маркированого товара </comment>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>фРежим</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>СборщикКомплектаТСД</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>КодКомплектаПодтвержденСканированием</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующее</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКомплекта</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФормированияКомплекта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомплектующегоНеНанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бригада</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ЗаменаМарокПоЗаказамFBS/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли
	;
	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли
	;
//
	Если Не ОбщегоНазначенияК.ЭтоСобытиеСканераНаКлиенте(Событие) Тогда
		Возврат;
	КонецЕсли; 	
	//
	//@skip-check undefined-variable
	глТорговоеОборудование.СканерПосылкаДанных(1);
	глСобытиеСканераОтработано = Истина;
	
	Если Не ЗначениеЗаполнено(ЗаказКлиентаFBS) Тогда
		
		ПоказатьПредупреждение( , "Необходимо выбрать заказ FBS");
		
		Возврат;
		
	КонецЕсли;
	
	Если ФормированиеНабораНаОбработкевЧЗ(РНК) Тогда

		ПоказатьПредупреждение( ,
			"Формирование набора по РНК находится в обработке в ЧЗ, необходимо отработать до конца ОМ!");

		Возврат;

	КонецЕсли;
	
	Если РежимСканирования = 0 Тогда

		РезультатОтработкиВвода = ОбработатьВВодШК(Данные);

		Если Не РезультатОтработкиВвода.Успешно Тогда
			
			МаркировкаКС.ВывестиОшибки(РезультатОтработкиВвода);
		
		Иначе

			НовыйКодКМ 		= РезультатОтработкиВвода.Данные.Получить(РезультатОтработкиВвода.Номенклатура)[0];
			КодСпайкиЗамена = РезультатОтработкиВвода.КодСпайки;
			КодЧЗСтарый		 = РезультатОтработкиВвода.КодЧЗСтарый; 
			
			ВывестиНаПечатьКодыДляСканирования();
			
			РежимСканирования = 1;
			
			ТекстИнформации = "Отсканируйте новую марку для продолжения"; 
			
			ТипОжидаемогоКода = 0; 
		
		КонецЕсли;
	Иначе
		
		РезультатПроверки = ОтработатьВВодШКДляПроверки(Данные); 
		
		Если РезультатПроверки.Успешно Тогда
			Если ТипОжидаемогоКода < 3  Тогда
				
				Сообщить("Продолжите проверку сканированием!"); 
			
			Иначе 
				
				Сообщить("Проверка сканированием прошла успешно!");	
				
				РезультатСоздания = ЗаменитьМаркуСтаруюНаНовую();
				Если РезультатСоздания.Успешно = Истина Тогда
					
					Сообщить("Были изменены документы:" + Символы.ПС + СтрСоединить(РезультатСоздания.Данные,
						Символы.ПС));
						
					Сообщить("Марка была заменена!");
				Иначе
					МаркировкаКС.ВывестиОшибки(РезультатСоздания);
				КонецЕсли;				  				
				
				
				
			КонецЕсли;
		Иначе
			МаркировкаКС.ВывестиОшибки(РезультатПроверки);
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстИнформации = "Выберите заказ FBS и отсканируйте марку для замены!"; 
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ЗаказКлиентаFBSПриИзменении(Элемент)
	
	ЗаказКлиентаFBSПриИзмененииНаСервере();

	ДанныеКМДляОтработки = ПолучитьОтсканированныеКодыПоЗаказу(ЗаказКлиентаFBS,РНК); 
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СброситьРежим(Команда)
		
	СброситьРежимНаКлиенте(); 
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаменитьМаркуСтаруюНаНовую()	
	
	Результат  = МаркировкаКС.СтруктураРезультата(Ложь); 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛистНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|ГДЕ
		|	ЛистНабора.ДокОснование = &ДокОснование
		|	И ЛистНабора.Проведен
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = &ШтрихкодУпаковки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛистПереукладки.Ссылка
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
		|		ПО ЛистПереукладкиШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
		|ГДЕ
		|	ЛистПереукладки.Проведен
		|	И ЛистПереукладки.ДокОснование = &ДокОснование
		|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = &ШтрихкодУпаковки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛистСборкиКомплектовЧЗ.Ссылка
		|ИЗ
		|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистСборкиКомплектовЧЗ КАК ЛистСборкиКомплектовЧЗ
		|		ПО ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = ЛистСборкиКомплектовЧЗ.Ссылка
		|ГДЕ
		|	ВЫРАЗИТЬ(ЛистСборкиКомплектовЧЗ.ДокОснование.ДокОснование КАК Документ.РасходнаяНакладная) = &ДокОснование
		|	И ЛистСборкиКомплектовЧЗ.ДокОснование.Проведен
		|	И (ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта = &ШтрихкодУпаковки
		|	ИЛИ ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки = &ШтрихкодУпаковки)";
	
	Запрос.УстановитьПараметр("ШтрихкодУпаковки", КодЧЗСтарый);
	Запрос.УстановитьПараметр("ДокОснование", РНК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	МассивДляЗаписиОбъекты = Новый Массив();
	
	МассивКМДляСпайки = Новый Массив; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбъектДляЗамены = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект(); 
		МассивДляЗаписиОбъекты.Добавить(ОбъектДляЗамены);

		Если ТипЗнч(ВыборкаДетальныеЗаписи.ссылка) = Тип("ДокументСсылка.ЛистСборкиКомплектовЧЗ") Тогда
		
			ОтборСтрок = Новый Структура("ШтрихкодУпаковки", КодЧЗСтарый);
			НайденныеСтроки = ОбъектДляЗамены.ШтрихкодыУпаковок.НайтиСтроки(ОтборСтрок);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ШтрихкодУпаковки = НовыйКодКМ;
			КонецЦикла;	
			
			ОтборСтрок = Новый Структура("ШтрихкодКомплекта", КодСпайкиЗамена);
			НайденныеСтроки = ОбъектДляЗамены.ШтрихкодыУпаковок.НайтиСтроки(ОтборСтрок);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				МассивКМДляСпайки.Добавить(НайденнаяСтрока.ШтрихкодУпаковки); 
			КонецЦикла;
			
			ОтборСтрок = Новый Структура("ШтрихкодКомплекта", КодЧЗСтарый);
			НайденныеСтроки = ОбъектДляЗамены.ШтрихкодыУпаковок.НайтиСтроки(ОтборСтрок);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ШтрихкодКомплекта = НовыйКодКМ;
			КонецЦикла;			
			
		Иначе
			 
			ОтборСтрок = Новый Структура("ШтрихкодУпаковки",КодЧЗСтарый);
			НайденныеСтроки = ОбъектДляЗамены.ШтрихкодыУпаковок.НайтиСтроки(ОтборСтрок);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ШтрихкодУпаковки = НовыйКодКМ; 
			КонецЦикла;				  
			 	
		КонецЕсли;
		
	КонецЦикла;
	
	
	СтатусОМ = СтатусФормированияНабораПоРНК(РНК);
	 
	Если СтатусОМ = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
		
		//ВыборкаДетальныеЗаписи = ЗапросФормированиеНабораПоРНК(РНК);
		//ВыборкаДетальныеЗаписи.Следующий();
		//создаваться будут по РНК
	    ДокРасФормированиеНаборов = СоздатьРасформированиеНаборов(РНК,КодСпайкиЗамена); 
		
		МассивДляЗаписиОбъекты.Добавить(ДокРасФормированиеНаборов);
		
		Если ОтсканированаСпайка Тогда
			ДокФормированиеНаборов = СоздатьФормированиеНаборов(РНК,НовыйКодКМ,МассивКМДляСпайки);
		Иначе 
			ДокФормированиеНаборов = СоздатьФормированиеНаборов(РНК,КодСпайкиЗамена,МассивКМДляСпайки);
		КонецЕсли;
		
		МассивДляЗаписиОбъекты.Добавить(ДокФормированиеНаборов);
		// 
	ИначеЕсли ЗначениеЗаполнено(СтатусОМ) Тогда  
		//иначе заменить 
		
		ВыборкаДетальныеЗаписи = ЗапросФормированиеНабораПоРНК(РНК);
		ВыборкаДетальныеЗаписи.Следующий(); 
		
		ОМОбъект = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект(); 
		
		ОтборСтрок = Новый Структура("ШтрихкодУпаковки", КодЧЗСтарый);
		НайденныеСтроки = ОМОбъект.ШтрихкодыУпаковок.НайтиСтроки(ОтборСтрок);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ШтрихкодУпаковки = НовыйКодКМ; 
		КонецЦикла;
		
		ОтборСтрок = Новый Структура("ШтрихкодНабора", КодЧЗСтарый);
		НайденныеСтроки = ОМОбъект.ШтрихкодыУпаковок.НайтиСтроки(ОтборСтрок);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ШтрихкодНабора = НовыйКодКМ; 
		КонецЦикла;
		
		МассивДляЗаписиОбъекты.Добавить(ОМОбъект);
		 	
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Для Каждого ЗаписьОбъекта Из МассивДляЗаписиОбъекты Цикл
		Попытка
			ЗаписьОбъекта.Записать(РежимЗаписиДокумента.Проведение);
			
			Результат.Данные.Добавить(ЗаписьОбъекта.ссылка);
			
		Исключение
			
			Результат.Ошибки.Добавить(ОписаниеОшибки()); 
			
		КонецПопытки;		
		
	КонецЦикла; 
	

	Если ТранзакцияАктивна() Тогда

		ЗафиксироватьТранзакцию();

	КонецЕсли;
	
	Результат.Успешно = результат.Ошибки.Количество() = 0; 
	
	Возврат Результат; 
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьРасформированиеНаборов(РНК,КодСпайки)
	
	ДокМаркировкиОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();
	ДокМаркировкиОбъект.Дата	= ТекущаяДатаСеанса();
	ДокМаркировкиОбъект.Комментарий = "Создан из обработки Замена марок по заказам FBS"; 
	
	Организация = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(РНК,"Организация");
	Склад = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(РНК,"Склад");
	Подразделение = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(Склад,"Подразделение");
	 
	ДокМаркировкиОбъект.Организация	= Организация;
	//ДокМаркировкиОбъект.Заполнить(ЗСБ);
	ДокМаркировкиОбъект.ДокументОснование 		= РНК;
	ДокМаркировкиОбъект.ПодразделениеНанесения 	= Подразделение;
	ДокМаркировкиОбъект.ДополнительныеСвойства.Вставить("ЗаполнятьТолькоШапку", Истина);

	ДокМаркировкиОбъект.ВидОперации		= Перечисления.ВидыОперацийМаркировки.РасформированиеУпаковки;
	ДокМаркировкиОбъект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.РасформированиеУпаковки;
	ДокМаркировкиОбъект.Статус			= Перечисления.СтатусыДокументовМаркировки.КОбработке;
	
	НоваяСтрока = ДокМаркировкиОбъект.ШтрихкодыУпаковок.Добавить(); 
	НоваяСтрока.ШтрихкодУпаковки = КодСпайки; 
	
	Возврат ДокМаркировкиОбъект; 
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьФормированиеНаборов(РНК,КодСпайки,МассивКомплектующих)
	
	Организация = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(РНК,"Организация");
	Склад = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(РНК,"Склад");
	Подразделение = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(Склад,"Подразделение");
	
	ДокОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();
	ДокОбъект.ДокументОснование = РНК; 
	ДокОбъект.Дата =  ТекущаяДатаСеанса(); 
	ДокОбъект.Комментарий = "Создан из обработки Замена марок по заказам FBS";
	ДокОбъект.ВидОперации 			= Перечисления.ВидыОперацийМаркировки.ФормированиеНабора; 
	ДокОбъект.ВидОперацииИСМП		= Перечисления.ВидыОперацийИСМП.ФормированиеНабора;
	ДокОбъект.Статус				= Перечисления.СтатусыДокументовМаркировки.КОбработке;
	ДокОбъект.Автор 				= ПараметрыСеанса.Пользователь;		
	ДокОбъект.Организация 			= Организация; 
	ДокОбъект.ТипУпаковки 			= Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	ДокОбъект.ТипШК					= Перечисления.ТипыШтрихКодов.Коробка; 	 
	ДокОбъект.ПодразделениеНанесения = Подразделение;
	
	Для Каждого ЭлементМассива Из МассивКомплектующих Цикл
		НоваяСтрокаТП = ДокОбъект.ШтрихкодыУпаковок.Добавить();
		НоваяСтрокаТП.ШтрихкодНабора 	= КодСпайки;
		НоваяСтрокаТП.ШтрихкодУпаковки 	= ЭлементМассива;
	КонецЦикла;
	
	Возврат ДокОбъект; 
	
КонецФункции

&НаСервере
Функция ОтработатьВВодШКДляПроверки(Данные)
	Результат	= МаркировкаКС.СтруктураРезультата(Ложь);
	Если ТипОжидаемогоКода = 2 Тогда
		
		Данные = СокрЛП(Данные);
		Если ДопПараметрыНакладной.Имя = "WB_FBS" Тогда
			//ШтрихКодFBS			 
			Если Данные = ШтрихКодFBS Тогда
				
				ТекстИнформации = "Проверка пройдена";
				ТипОжидаемогоКода = 3;
				Результат.Успешно = Истина;
				
				Возврат Результат;
				
			Иначе
				ТекстСоощения = СтрШаблон("Отсканированный код не соответствует ожидаемому, ожидаемый %1", ШтрихКодFBS);

				Результат.Ошибки.Добавить(ТекстСоощения);

				Возврат Результат;
				
			КонецЕсли;
		Иначе
			//номер заказа FBS 
			
			Если Данные = НомерЗаказаFBS Тогда
				
				ТекстИнформации = "Проверка пройдена";
				ТипОжидаемогоКода = 3;				
				Результат.Успешно = Истина;
				
				Возврат Результат; 
				
			Иначе
				ТекстСоощения = СтрШаблон("Отсканированный код не соответствует ожидаемому, ожидаемый %1", НомерЗаказаFBS);

				Результат.Ошибки.Добавить(ТекстСоощения);

				Возврат Результат;
				
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Если СтрДлина(Данные) < 31 Тогда

			ТекстСоощения = НСтр("ru = 'В данном документе разрешено сканировать товар только по кодам ЧЗ !'");

			Результат.Ошибки.Добавить(ТекстСоощения);
			Возврат Результат;
		КонецЕсли;
		Если СтрНайти(Данные, Символ(29)) > 0 Тогда
			Данные 	= СтрЗаменить(Данные, Символ(29), "");
		КонецЕсли;
		Данные 	= Лев(СтрЗаменить(Данные, Символы.ПС, ""), 31);

		Запрос = Новый Запрос;
		Запрос.Текст = "
					   |ВЫБРАТЬ
					   |	Владелец		КАК Номенклатура,
					   |	Владелец.Код	КАК Номенклатура_Код,
					   |	Ссылка 			КАК КодМаркировки,
					   |	СпособВводаВОборот
					   |ИЗ
					   |	Справочник.ШтрихкодыУпаковокТоваров	
					   |ГДЕ
					   |	Наименование = &ДанныеКМ
					   |	И ( 
					   |		ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар)
					   |		ИЛИ ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
					   |	)
					   |";

		Запрос.УстановитьПараметр("ДанныеКМ", Данные);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда

			ТекстСоощения = НСтр("ru = 'Не найден код ЧЗ!'");
			Результат.Ошибки.Добавить(ТекстСоощения);

			Возврат Результат;

		КонецЕсли;

		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда

			Если ТипОжидаемогоКода = 0 Тогда
				Если НовыйКодКМ = Выборка.КодМаркировки Тогда
					ТипОжидаемогоКода = 1;
					ТекстИнформации = "Отсканируйте код спайки для продолжения";
					Результат.Успешно = Истина;
					Возврат Результат;
				Иначе

					ТекстСоощения = СтрШаблон("Отсканированный код не соответствует ожидаемому, ожидаемый %1",
						НовыйКодКМ);

					Результат.Ошибки.Добавить(ТекстСоощения);

					Возврат Результат;
				КонецЕсли;
			ИначеЕсли ТипОжидаемогоКода = 1 Тогда

				Если КодСпайкиЗамена = Выборка.КодМаркировки Тогда

					ТипОжидаемогоКода = 2;
					ТекстИнформации = "Отсканируйте код этикетки для продолжения";
					Результат.Успешно = Истина; 
					Возврат Результат; 
				Иначе

					ТекстСоощения = СтрШаблон("Отсканированный код не соответствует ожидаемому, ожидаемый %1",
						КодСпайкиЗамена);

					Результат.Ошибки.Добавить(ТекстСоощения);

					Возврат Результат;
				КонецЕсли;			
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	
	ТекстСоощения = СтрШаблон("Дальнейшая обработка не предусматривает сканирование, проверьте режим сканирования!");

	Результат.Ошибки.Добавить(ТекстСоощения);

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СброситьРежимНаКлиенте()
	РежимСканирования = 0; 
	
	НовыйКодКМ 			= ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка"); 
	КодСпайкиЗамена 	= ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка");
	КодЧЗСтарый 		= ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка");
	
	ИмитацияСканирования 	= ""; 
	ОтсканированаСпайка 	= Ложь;
	
	ТекстИнформации = "Отсканируйте марку для замены!";
КонецПроцедуры

&НаКлиенте
Процедура ВывестиНаПечатьКодыДляСканирования()
	
	ТабДок1 = ТабДокЭтикеткаЧЗ(НовыйКодКМ); 
	
	ТабДок2 = ТабДокЭтикеткаЧЗ(КодСпайкиЗамена);
	
   Если ДопПараметрыНакладной.Имя = "WB_FBS" Тогда

		ТабДок3 = ТабДокЭтикеткаWB(ШтрихКодFBS, ПрефиксЗаказа, СуффиксЗаказа);

	Иначе
		
		ТабДок3 = ТабДокВременнаяЭтикеткаFBS(НомерЗаказаFBS);
   
   КонецЕсли;

	 
	Если ВыводитьПечатныеФормыНаПредпросмотр() Тогда
		ТабДок1.Показать(); 
		ТабДок2.Показать();
		ТабДок3.Показать(); 		
		
	Иначе
		ТабДок1.Напечатать();
		ТабДок2.Напечатать();
		ТабДок3.Напечатать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыводитьПечатныеФормыНаПредпросмотр()
	Возврат ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр; 
КонецФункции

&НаСервереБезКонтекста
Функция ТабДокЭтикеткаWB(Знач ШтрихКодFBS, Знач ПрефиксЗаказа,Знач СуффиксЗаказа)
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ИмяПараметровПечати = "АналогЗПЛВайлдберрис";
	
	ПолноеИмяФайла = СокрЛП(Константы.КаталогВнешнихОтчетов.Получить() + "PrnForms\РаботаСЗаказомКлиента.epf");
	ОбработкаПечати = ВнешниеОбработки.Создать(ПолноеИмяФайла);
	
	Макет = ОбработкаПечати.ПолучитьМакет("КРВайлдберис"); 

	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОблСтрока.Параметры.ПрефиксЗаказа = ПрефиксЗаказа;
	ОблСтрока.Параметры.СуффиксЗаказа = СуффиксЗаказа;
	
	Размер = 144;
	
	ДвДанные = ФормированиеПечатныхФорм.ДанныеQRКода(ШтрихКодFBS, 0, Размер);
	
	Если ДвДанные <> Неопределено Тогда
		Карт = Новый Картинка(ДвДанные);				
		ОблСтрока.Область(1, 2).Картинка = Карт;
	КонецЕсли;
	
	ТабДок.РазмерСтраницы = "Custom";
	ТабДок.ВысотаСтраницы = 41;
	ТабДок.ШиринаСтраницы = 58;
	ТабДок.ПолеСправа = 0;
	ТабДок.ПолеСлева = 0;
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСнизу = 0;
	ТабДок.Автомасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	ТабДок.Вывести(ОблСтрока);
	
	Возврат ТабДок; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ТабДокВременнаяЭтикеткаFBS(Знач НомерЗаказаFBS)
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ИмяПараметровПечати = "ВременнаяЭтикеткаFBS";
	
	Макет = Обработки.АРМ_ФормированиеЗаказовFBS.ПолучитьМакет("ВременнаяЭтикеткаFBS");
	
	ОбластьЭтикетки = Макет.ПолучитьОбласть("Этикетка");

	ОбластьЭтикетки.Параметры.НомерЗаказа = НомерЗаказаFBS;
	
	Компонента = ПодключитьКомпонентуИзМакета("Barcode", "ОбщийМакет.КомпонентаПечатиШтрихкодов");
	
	ПараметрыШК = Маркировка_ПИ.ПараметрыГенерацииШКпоУмолчанию();
	Рисунок = ОбластьЭтикетки.Рисунки.ШтрихКод;
	
	Эталон = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМакет("Эталон");
	ММвВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;	
	
	ПараметрыШК.ТипКода	= 99;
	
	ПараметрыШК.Высота = Окр(Рисунок.Высота / ММвВПикселе);
	ПараметрыШК.Ширина = Окр(Рисунок.Ширина / ММвВПикселе);
	
	ПараметрыШК.Масштабировать = Ложь;	
	ПараметрыШК.СохранятьПропорции = Истина;	
	ПараметрыШК.ОтображатьТекст = Истина;
	ПараметрыШК.РазмерШрифта = 12;
	ПараметрыШК.ВертикальноеВыравнивание = 1;	
	
	ПараметрыШК.УголПоворота = 0;	
	ПараметрыШК.Штрихкод = НомерЗаказаFBS;	
	ПараметрыШК.УбратьЛишнийФон = Истина;
	
	РШтрихКод = ПодготовитьИзображениеШтрихкодаEAN13(Компонента, ПараметрыШК);	
	
	Рисунок.Картинка = рШтрихКод.Картинка;
		
	ТабДок.Вывести(ОбластьЭтикетки);
	
	Возврат ТабДок; 
	
КонецФункции


&НаСервереБезКонтекста
Функция ПодготовитьИзображениеШтрихкодаEAN13(ВнешняяКомпонента, ПараметрыШтрихкода)	
	// Результат 
	РезультатОперации = Новый Структура("Успешно,ДвоичныеДанные,Картинка", Ложь);	
	
	// Зададим размер формируемой картинки.
	ШиринаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Ширина),1);
	ВысотаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Высота),1);	
	
	ВнешняяКомпонента.Ширина = ШиринаШтрихкода;
	ВнешняяКомпонента.Высота = ВысотаШтрихкода;
	ВнешняяКомпонента.АвтоТип = Ложь;
	
	ШтрихкодВрем = Строка(ПараметрыШтрихкода.Штрихкод); // Преобразуем явно в строку.
	
	Если ПараметрыШтрихкода.ТипКода = 99 Тогда
		ВнешняяКомпонента.АвтоТип = Истина;
	Иначе
		ВнешняяКомпонента.АвтоТип = Ложь;
		ВнешняяКомпонента.ТипКода = ПараметрыШтрихкода.ТипКода;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ПрозрачныйФон") Тогда
		ВнешняяКомпонента.ПрозрачныйФон = ПараметрыШтрихкода.ПрозрачныйФон;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ТипВходныхДанных") Тогда
		ВнешняяКомпонента.ТипВходныхДанных = ПараметрыШтрихкода.ТипВходныхДанных;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("GS1DatabarКоличествоСтрок") Тогда
		ВнешняяКомпонента.GS1DatabarКоличествоСтрок = ПараметрыШтрихкода.GS1DatabarКоличествоСтрок;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("УбратьЛишнийФон") Тогда
		ВнешняяКомпонента.УбратьЛишнийФон = ПараметрыШтрихкода.УбратьЛишнийФон;
	КонецЕсли;
	
	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	// Формируем картинку штрихкода.
	ВнешняяКомпонента.ЗначениеКода = ШтрихкодВрем;
	// Угол поворота штрихкода.
	ВнешняяКомпонента.УголПоворота = ?(ПараметрыШтрихкода.Свойство("УголПоворота"), ПараметрыШтрихкода.УголПоворота, 0);
	// Уровень коррекции QR кода (L=0, M=1, Q=2, H=3).
	ВнешняяКомпонента.УровеньКоррекцииQR = ?(ПараметрыШтрихкода.Свойство("УровеньКоррекцииQR"), ПараметрыШтрихкода.УровеньКоррекцииQR, 1);
	
	// Для обеспечения совместимости с предыдущими версиями БПО.
	Если Не ПараметрыШтрихкода.Свойство("Масштабировать")
		Или (ПараметрыШтрихкода.Свойство("Масштабировать") И ПараметрыШтрихкода.Масштабировать) Тогда
		
		Если Не ПараметрыШтрихкода.Свойство("СохранятьПропорции")
			Или (ПараметрыШтрихкода.Свойство("СохранятьПропорции") И Не ПараметрыШтрихкода.СохранятьПропорции) Тогда
			// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
				ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
			КонецЕсли;
			// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
				ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
			КонецЕсли;
		ИначеЕсли ПараметрыШтрихкода.Свойство("СохранятьПропорции") И ПараметрыШтрихкода.СохранятьПропорции Тогда
			Пока ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода 
				Или ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Цикл
				// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
					ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
					ВнешняяКомпонента.Высота = Окр(ВнешняяКомпонента.МинимальнаяШиринаКода / ШиринаШтрихкода) * ВысотаШтрихкода;
				КонецЕсли;
				// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
					ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
					ВнешняяКомпонента.Ширина = Окр(ВнешняяКомпонента.МинимальнаяВысотаКода / ВысотаШтрихкода) * ШиринаШтрихкода;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// ВертикальноеВыравниваниеКода: 1 - по верхнему краю, 2 - по центру, 3 - по нижнему краю.
	Если ПараметрыШтрихкода.Свойство("ВертикальноеВыравнивание") И (ПараметрыШтрихкода.ВертикальноеВыравнивание > 0) Тогда
		ВнешняяКомпонента.ВертикальноеВыравниваниеКода = ПараметрыШтрихкода.ВертикальноеВыравнивание;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И (ПараметрыШтрихкода.РазмерШрифта > 0) 
		И (ПараметрыШтрихкода.ОтображатьТекст) И (ВнешняяКомпонента.РазмерШрифта <> ПараметрыШтрихкода.РазмерШрифта) Тогда
		ВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И ПараметрыШтрихкода.РазмерШрифта > 0
		И ПараметрыШтрихкода.Свойство("МонохромныйШрифт") Тогда
		Если ПараметрыШтрихкода.МонохромныйШрифт Тогда
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = ПараметрыШтрихкода.РазмерШрифта + 1;
		Иначе
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = -1;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.ТипКода = 16 Тогда // QR
		Если ПараметрыШтрихкода.Свойство("ЛоготипКартинка") И ЗначениеЗаполнено(ПараметрыШтрихкода.ЛоготипКартинка) Тогда 
			ВнешняяКомпонента.ЛоготипКартинка = ПараметрыШтрихкода.ЛоготипКартинка;    
		Иначе
			ВнешняяКомпонента.ЛоготипКартинка = "";
		КонецЕсли;
		Если ПараметрыШтрихкода.Свойство("ЛоготипРазмерПроцентОтШК") И Не ПустаяСтрока(ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК) Тогда 
			ВнешняяКомпонента.ЛоготипРазмерПроцентОтШК = ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК;
		КонецЕсли;
	КонецЕсли;
	
	// Сформируем картинку
	ДвоичныеДанныеКартинки 		= ВнешняяКомпонента.ПолучитьШтрихкод();
	РезультатОперации.Успешно 	= (ВнешняяКомпонента.Результат = 0);
	// Если картинка сформировалась.
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		РезультатОперации.ДвоичныеДанные	= ДвоичныеДанныеКартинки;
		РезультатОперации.Картинка 			= Новый Картинка(ДвоичныеДанныеКартинки); // Формируем из двоичных данных.
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТабДокЭтикеткаЧЗ(Знач КодДляПечати)
	
	ОбработкаПечатиЧЗ = Обработки.ПечатьЭтикетокЧЗ.Создать();
		
	ИмяМакета = "Этикетка_25_25";
	Макет = ОбработкаПечатиЧЗ.ПолучитьМакет(ИмяМакета);
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;	
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_КМ_" + ИмяМакета;	
	
	ДопПараметры = Новый Структура("НомерШтуки, НомерКоробки, ШтукВКоробке", 1, 1, 1);
	
	ДанныеДляПечати	= МаркировкаКС.ПолучитьПоляКМДляПечати(КодДляПечати);
		
	Область = ОбработкаПечатиЧЗ.СформироватьЭтикету(Макет, ДанныеДляПечати, ДопПараметры);
	
	ТабДок.Вывести(Область);
	
	Возврат ТабДок; 
	
КонецФункции



&НаСервере
Функция ОбработатьВВодШК(Данные)
	
	ОтсканированаСпайка = Ложь; 
	
	Результат	= МаркировкаКС.СтруктураРезультата(Ложь);
	Если СтрДлина(Данные) < 31 Тогда
		
		ТекстСоощения = НСтр("ru = 'В данном документе разрешено сканировать товар только по кодам ЧЗ !'"); 
		
		Результат.Ошибки.Добавить(ТекстСоощения); 
		Возврат Результат; 
	КонецЕсли;
	Если СтрНайти(Данные, Символ(29)) > 0 Тогда
		Данные 	= СтрЗаменить(Данные, Символ(29), "");
	КонецЕсли;
	Данные 	= Лев(СтрЗаменить(Данные, Символы.ПС, ""), 31);
		
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Владелец		КАК Номенклатура,
	|	Владелец.Код	КАК Номенклатура_Код,
	|	Ссылка 			КАК КодМаркировки,
	|	СпособВводаВОборот
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров	
	|ГДЕ
	|	Наименование = &ДанныеКМ
	|	И ( 
	|		ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар)
	|		ИЛИ ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
	|	)
	|";
	
	Запрос.УстановитьПараметр("ДанныеКМ", Данные);
	РезультатЗапроса = Запрос.Выполнить(); 
	Если РезультатЗапроса.Пустой() Тогда
		
		ТекстСоощения = НСтр("ru = 'Не найден код ЧЗ!'");
		Результат.Ошибки.Добавить(ТекстСоощения);
		
		Возврат Результат;
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Если ДанныеКМДляОтработки.МассивКМ.Найти(Выборка.КодМаркировки) = Неопределено Тогда
			
			ТекстСоощения = НСтр("ru = 'Отсканированный код не принадлежит выбранному заказу FBS'");
			Результат.Ошибки.Добавить(ТекстСоощения);

			Возврат Результат;
			
		ИначеЕсли  ДанныеКМДляОтработки.СпайкиШтуки.Получить(Выборка.КодМаркировки) <> Неопределено Тогда 
			
			ОтсканированаСпайка = Истина;
			
		КонецЕсли;
		
		Если ОтсканированаСпайка Тогда
			ЛСК = ДанныеКМДляОтработки.СпайкиЛСК.Получить(Выборка.КодМаркировки);
			КодСпайки = Выборка.КодМаркировки; 
		Иначе

			КодСпайки = ДанныеКМДляОтработки.ШтукиСпайки.Получить(Выборка.КодМаркировки);
			ЛСК = ДанныеКМДляОтработки.СпайкиЛСК.Получить(КодСпайки);
		КонецЕсли;
		
		РезультатПолучНовогоКода = ПодобратьКодМаркировки(Выборка.КодМаркировки,ЛСК,ОтсканированаСпайка); 
		
		Если НЕ РезультатПолучНовогоКода.Успешно Тогда
		
			МаркировкаКС.ДобавитьОшибки(Результат, РезультатПолучНовогоКода);
			Возврат Результат; 
		Иначе
			
			Результат.Успешно = Истина; 
			Результат.Данные = РезультатПолучНовогоКода.Данные; 
			
			Результат.Вставить("КодСпайки",КодСпайки); 
			Результат.Вставить("КодЧЗСтарый",Выборка.КодМаркировки);
			Результат.Вставить("Номенклатура",Выборка.Номенклатура);
		КонецЕсли;	
		
	КонецЕсли;
		
	ДанныеДляЗаполнения = ЗаполнитьДанныеПоЗаказуFBS(КодСпайки,РНК,ЗаказКлиентаFBS); 
	
	Если Не ЗначениеЗаполнено(ДанныеДляЗаполнения.НомерЗаказаFBS) Тогда
		
		ТекстСоощения = НСтр("ru = 'Не заполнен номер заказа FBS'");
		Результат.Ошибки.Добавить(ТекстСоощения);
		
	Иначе 
		
		НомерЗаказаFBS = ДанныеДляЗаполнения.НомерЗаказаFBS; 
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДляЗаполнения.ШтрихКодFBS) Тогда
		
		ТекстСоощения = НСтр("ru = 'Не заполнен штрихкод FBS'");
		Результат.Ошибки.Добавить(ТекстСоощения);
		
	Иначе 
		
		ШтрихКодFBS = ДанныеДляЗаполнения.ШтрихКодFBS;
		
	КонецЕсли;
	
	ПрефиксЗаказа = ДанныеДляЗаполнения.ПрефиксЗаказа; 
	СуффиксЗаказа = ДанныеДляЗаполнения.СуффиксЗаказа; 
	
	Результат.Успешно = Результат.Ошибки.Количество() = 0;
	
	Возврат Результат; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьДанныеПоЗаказуFBS(КМЧЗ,РНКЗаказа,ЗаказКлиента)
	
	Данные = Новый Структура("НомерЗаказаFBS,ШтрихКодFBS,ПрефиксЗаказа,СуффиксЗаказа","","","",""); 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛистПереукладкиШтрихкодыУпаковок.НомерЗаказа КАК НомерЗаказаFBS,
	|	ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура
	|ИЗ
	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
	|ГДЕ
	|	ЛистПереукладкиШтрихкодыУпаковок.Ссылка.ДокОснование = &РНК
	|	И ЛистПереукладкиШтрихкодыУпаковок.Ссылка.Проведен
	|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = &ШтрихкодУпаковки";

	Запрос.УстановитьПараметр("РНК", РНКЗаказа);
	Запрос.УстановитьПараметр("ШтрихкодУпаковки", КМЧЗ);
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		Возврат Данные;

	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS КАК ШтрихКодFBS,
		|	ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS КАК НомерЗаказаFBS,
		|	ПолныеДанныеЗаданияНабораТовары.ПрефиксЗаказа КАК ПрефиксЗаказа,
		|	ПолныеДанныеЗаданияНабораТовары.СуффиксЗаказа КАК СуффиксЗаказа
		|ИЗ
		|	Документ.ПолныеДанныеЗаданияНабора.Товары КАК ПолныеДанныеЗаданияНабораТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПолныеДанныеЗаданияНабора КАК ПолныеДанныеЗаданияНабора
		|		ПО ПолныеДанныеЗаданияНабораТовары.Ссылка = ПолныеДанныеЗаданияНабора.Ссылка
		|ГДЕ
		|	ПолныеДанныеЗаданияНабора.Проведен
		|	И ПолныеДанныеЗаданияНабора.ЗаказКлиентаFBS = &ЗаказКлиентаFBS
		|	И ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS = &НомерЗаказаFBS
		|	И ПолныеДанныеЗаданияНабораТовары.Номенклатура = &Номенклатура";

		Запрос.УстановитьПараметр("Номенклатура", Выборка.Номенклатура);
		Запрос.УстановитьПараметр("НомерЗаказаFBS", Выборка.НомерЗаказаFBS);
		Запрос.УстановитьПараметр("ЗаказКлиентаFBS", ЗаказКлиента);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Данные, ВыборкаДетальныеЗаписи);
		КонецЕсли;
	КонецЕсли;

	Возврат Данные; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодобратьКодМаркировки(Знач КодМаркировки, ЗНАЧ ЛСК, ЭтоСпайка = Ложь)
	
	СтруктураРезультата	= МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если ЭтоСпайка Тогда
		ДопПараметры=Новый Структура("НовыйСтатус,ТипКода,Добавлять",
			Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован, Перечисления.ТипыКодовМаркировки.Набор, Истина);
	Иначе
		ДопПараметры = Новый Структура("Количество,Период,НовыйСтатус,Добавлять", 1, ТекущаяДатаСеанса(),
			Перечисления.СтатусыКодовМаркировкиФакт.Вложен, Истина);
	КонецЕсли;
	
	Владелец = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(КодМаркировки,"Владелец"); 
	
	рПолучения	= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(
					Владелец, ЛСК, ДопПараметры);
	Если рПолучения.Успешно Тогда

		СтруктураРезультата.Данные = рПолучения.Данные;
		СтруктураРезультата.Успешно = Истина; 
	Иначе
		МаркировкаКС.ДобавитьОшибки(СтруктураРезультата, рПолучения);

	КонецЕсли;
	
	Возврат СтруктураРезультата; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОтсканированныеКодыПоЗаказу(Знач ЗаказКлиентаFBSВыбр,ЗНАЧ РНКПоЗаказу)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛСКШтрихкодыУпаковок.ШтрихкодКомплекта КАК ШтрихкодКомплекта,
	|	ЛСКШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ЛСК.Ссылка КАК ЛСК
	|ИЗ
	|	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистСборкиКомплектовЧЗ КАК ЛСК
	|		ПО (ЛСК.Проведен)
	|			И ((ВЫРАЗИТЬ(ЛСК.ДокОснование.ДокОснование КАК Документ.РасходнаяНакладная)) = &РНК)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистСборкиКомплектовЧЗ.Товары КАК ЛСКТовары
	|		ПО (ЛСКТовары.Ссылка = ЛСК.Ссылка)
	|			И (ЛСКТовары.Номенклатура = ЗаказКлиентаFBSТовары.Номенклатура)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛСКШтрихкодыУпаковок
	|		ПО (ЛСКШтрихкодыУпаковок.Ссылка = ЛСК.Ссылка)
	|ГДЕ
	|	ЗаказКлиентаFBSТовары.Ссылка = &ЗаказКлиентаFBS";

	Запрос.УстановитьПараметр("ЗаказКлиентаFBS", ЗаказКлиентаFBSВыбр);
	Запрос.УстановитьПараметр("РНК", РНКПоЗаказу);
	
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СоответствиеСпайкаШтуки = Новый Соответствие();
	 
	СоответствиеШтукиСпайки = Новый Соответствие();
	
	СоответствиеСпайкаЛСК = Новый Соответствие();
		
	МассивКМ = Новый Массив();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если СоответствиеСпайкаШтуки.Получить(ВыборкаДетальныеЗаписи.ШтрихкодКомплекта) = Неопределено Тогда
			МассивШтук = Новый Массив;
		Иначе
			МассивШтук = СоответствиеСпайкаШтуки.Получить(ВыборкаДетальныеЗаписи.ШтрихкодКомплекта);
		КонецЕсли;

		МассивШтук.Добавить(ВыборкаДетальныеЗаписи.ШтрихкодУпаковки);

		СоответствиеСпайкаШтуки.Вставить(ВыборкаДетальныеЗаписи.ШтрихкодКомплекта, МассивШтук);

		СоответствиеШтукиСпайки.Вставить(ВыборкаДетальныеЗаписи.ШтрихкодУпаковки,
			ВыборкаДетальныеЗаписи.ШтрихкодКомплекта);

		СоответствиеСпайкаЛСК.Вставить(ВыборкаДетальныеЗаписи.ШтрихкодКомплекта, ВыборкаДетальныеЗаписи.ЛСК);

		МассивКМ.Добавить(ВыборкаДетальныеЗаписи.ШтрихкодКомплекта);
		МассивКМ.Добавить(ВыборкаДетальныеЗаписи.ШтрихкодУпаковки);

	КонецЦикла;

	Возврат Новый Структура("МассивКМ,СпайкиШтуки,ШтукиСпайки,СпайкиЛСК", МассивКМ, СоответствиеСпайкаШтуки,
		СоответствиеШтукиСпайки, СоответствиеСпайкаЛСК);
	 	
КонецФункции

&НаСервере
Процедура ЗаказКлиентаFBSПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(ЗаказКлиентаFBS) Тогда
		РНК = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ЗаказКлиентаFBS,"ДокОснование");
		
		Если ФормированиеНабораНаОбработкевЧЗ(РНК) Тогда
			ТекстИнформации = "Формирование набора по РНК находится в обработке в ЧЗ, необходимо отработать до конца ОМ!";
		Иначе
			ТекстИнформации = "Отсканируйте марку для замены!";
			ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(РНК);
		КонецЕсли; 
	Иначе
		РНК = Документы.РасходнаяНакладная.ПустаяСсылка();
		ТекстИнформации = "Выберите заказ FBS и отсканируйте марку для замены!";
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФормированиеНабораНаОбработкевЧЗ(Знач РНК)
	Статус = СтатусФормированияНабораПоРНК(РНК); 
	
	СтатусыВЧЗ = новый Массив();
	СтатусыВЧЗ.Добавить(Перечисления.СтатусыДокументовМаркировки.Обрабатывается);
	СтатусыВЧЗ.Добавить(Перечисления.СтатусыДокументовМаркировки.ОбработанЧЗ);
	СтатусыВЧЗ.Добавить(Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработкиЧЗ);
	
	Возврат СтатусыВЧЗ.Найти(Статус) <> неопределено; 
	
КонецФункции

&НаСервереБезКонтекста
Функция СтатусФормированияНабораПоРНК(Знач РНК)
	
	ВыборкаДетальныеЗаписи = ЗапросФормированиеНабораПоРНК(РНК);
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Статус; 
	КонецЕсли;
	 
	Возврат Перечисления.СтатусыДокументовМаркировки.ПустаяСсылка(); 
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапросФормированиеНабораПоРНК(Знач РНК)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МаркировкаТоваровИСМП.Статус КАК Статус,
		|	МаркировкаТоваровИСМП.Ссылка КАК Ссылка,
		|	МаркировкаТоваровИСМП.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаСборкуКомплектовЧЗ КАК ЗаданиеНаСборкуКомплектовЧЗ
		|		ПО МаркировкаТоваровИСМП.ДокументОснование = ЗаданиеНаСборкуКомплектовЧЗ.Ссылка
		|ГДЕ
		|	МаркировкаТоваровИСМП.Проведен
		|	И МаркировкаТоваровИСМП.ВидОперации = &ВидОперации
		|	И ЗаданиеНаСборкуКомплектовЧЗ.Проведен
		|	И ЗаданиеНаСборкуКомплектовЧЗ.ДокОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", РНК);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийМаркировки.ФормированиеНабора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции


&НаКлиенте
Процедура ИмитацияСканированияПриИзменении(Элемент)
	ВнешнееСобытие(Неопределено,"BarCodeValue",ИмитацияСканирования); 
КонецПроцедуры
#КонецОбласти
